export const workoutProgram = {
    0: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    1: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    2: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    3: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    4: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    5: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    6: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    7: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    8: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    9: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    10: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    11: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    12: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    13: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    14: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    15: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    16: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    17: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    18: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    19: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    20: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    21: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    22: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    23: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    24: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    25: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    26: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    27: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    28: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    29: {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      },
    
}


export const exerciseDescriptions = {
        "قبل النوم": "تكرار المحفوظ قبل النوم يساعد على تثبيت الحفظ. اقرأ الآيات 15 مرة بتركيز، بصوت مسموع أو همس، دون تشتيت.",
        "في يوم الحفظ": "كرّر الآيات الجديدة 15 مرة بنفس اليوم الذي حفظتها فيه، وركّز على مخارج الحروف والتجويد الصحيح.",
        "مراجعة القريب: اخر 20 صفحة": "راجع آخر 20 صفحة حفظتها خلال الأسبوع الماضي. استخدم المصحف بدون تغطية، وركّز على التلاوة الصحيحة.",
        "مراجعة البعيد: موزعة على أسبوع او اسبوعين": "راجع المحفوظ القديم من أجزاء سابقة على مدار أسبوع أو أسبوعين، قسمه يوميًا حسب القدرة، واحرص على التكرار والمراجعة بالتسميع.",
        "جزئين تلاوة": "اقرأ جزئين من القرآن تلاوة بتدبر، دون حفظ. لا بأس بتكرار الآيات أو الرجوع إن شعرت بالشرود.",
        "حزب استماع لقارئ": "استمع لحزب من القرآن بصوت قارئ مجوّد. حاول المتابعة في المصحف أو بالذاكرة، وركّز على التجويد والنطق.",
        "7 صفحات من حفظ الأسبوع المقبل": "ابدأ بتلاوة ومراجعة 7 صفحات مستهدفة للحفظ الأسبوع المقبل. هذا يساعد على التمهيد العقلي وربط السياق."  
}

