export const workoutProgram = {}
      let day = {
        memorise: [
          { name: "قبل النوم", sets: 2, reps: 15 },
          { name: "في يوم الحفظ", sets: 2, reps: 15 },
          { name: "مراجعة القريب: اخر 20 صفحة", sets: 1, reps: 20 },
          { name: "مراجعة البعيد: موزعة على أسبوع او اسبوعين", sets: 7, reps: 40 }
        ],
        recite: [
          { name: "جزئين تلاوة", sets: 1, reps: 40 },
          { name: "حزب استماع لقارئ", sets: 1, reps: 10 },
          { name: "7 صفحات من حفظ الأسبوع المقبل", sets: 1, reps: 7 }
        ]
      }

      const quranPages= 604;
      const parts = 20;
      const halfPart = 10;

      let inputDay = prompt("مقدار الحفظ اليومي؟ " + "\n" + "(ادخل 1: نصف وجه" + "\n" + "ادخل 2: صفحة" + "\n" + "ادخل 3: صفحتين)");
      while(true){
        if (inputDay ==1){
          inputDay = 604 * 2;
          break;
        }else if (inputDay == 2){
          inputDay = 604;
          break;
        }else if (inputDay == 3){
          inputDay = 604/2;
          break;
        }else{
         inputDay = prompt("مقدار الحفظ اليومي؟ " + "\n" + "(ادخل 1: نصف وجه" + "\n" + "ادخل 2: صفحة" + "\n" + "ادخل 3: صفحتين)");

        }
      }
      
      for(let i = 0; i < inputDay; i++){
        workoutProgram[i] = {...day}
      }

export const exerciseDescriptions = {
        "قبل النوم": "تكرار المحفوظ قبل النوم يساعد على تثبيت الحفظ. اقرأ الآيات 15 مرة بتركيز، بصوت مسموع أو همس، دون تشتيت.",
        "في يوم الحفظ": "كرّر الآيات الجديدة 15 مرة بنفس اليوم الذي حفظتها فيه، وركّز على مخارج الحروف والتجويد الصحيح.",
        "مراجعة القريب: اخر 20 صفحة": "راجع آخر 20 صفحة حفظتها خلال الأسبوع الماضي. استخدم المصحف بدون تغطية، وركّز على التلاوة الصحيحة.",
        "مراجعة البعيد: موزعة على أسبوع او اسبوعين": "راجع المحفوظ القديم من أجزاء سابقة على مدار أسبوع أو أسبوعين، قسمه يوميًا حسب القدرة، واحرص على التكرار والمراجعة بالتسميع.",
        "جزئين تلاوة": "اقرأ جزئين من القرآن تلاوة بتدبر، دون حفظ. لا بأس بتكرار الآيات أو الرجوع إن شعرت بالشرود.",
        "حزب استماع لقارئ": "استمع لحزب من القرآن بصوت قارئ مجوّد. حاول المتابعة في المصحف أو بالذاكرة، وركّز على التجويد والنطق.",
        "7 صفحات من حفظ الأسبوع المقبل": "ابدأ بتلاوة ومراجعة 7 صفحات مستهدفة للحفظ الأسبوع المقبل. هذا يساعد على التمهيد العقلي وربط السياق."  
}

